site_stock/app/controllers/dependencies_controller.rb

  def index
    @dependencies = Dependency.all
---
SELECT `dependencies`.* FROM `dependencies`