site_stock/app/controllers/isles_controller.rb

SELECT `isles`.* FROM `isles`
---
  def index
    @isles = Isle.all

SELECT `isles`.* FROM `isles` WHERE `isles`.`id` = 1 LIMIT 1
---
  def show
    @isle = Isle.find(params[:id])

SELECT `isles`.* FROM `isles` WHERE `isles`.`id` = 2 LIMIT 1
---
  def edit
    @isle = Isle.find(params[:id])

INSERT INTO `isles` (`NOMBRE_ISLA`, `created_at`, `updated_at`) VALUES ('Pavas', '2013-01-10 17:52:56', '2013-01-10 17:52:56')
---
  def create
    @isle = Isle.new(params[:isle])

    respond_to do |format|
      if @isle.save

SELECT `isles`.* FROM `isles` WHERE `isles`.`id` = 2 LIMIT 1
UPDATE `isles` SET `updated_at` = '2013-01-10 19:41:08', `NOMBRE_ISLA` = 'Paves' WHERE `isles`.`id` = 2
---
  def update
    @isle = Isle.find(params[:id])

    respond_to do |format|
      if @isle.update_attributes(params[:isle])

SELECT `isles`.* FROM `isles` WHERE `isles`.`id` = 1 LIMIT 1
DELETE FROM `isles` WHERE `isles`.`id` = 1
---
  def destroy
    @isle = Isle.find(params[:id])
    @isle.destroy