site_stock/app/controllers/searches_controller.rb

SELECT `searches`.* FROM `searches`
---
  def index
    @searches = Search.all

SELECT `searches`.* FROM `searches` WHERE `searches`.`id` = 1 LIMIT 1
---
  def show
    @search = Search.find(params[:id])

INSERT INTO `searches` (`CODiGO`, `IP`, `ISLA`, `MEDIO`, `NOMBRE`, `TIPO`, `created_at`, `new`, `show`, `updated_at`) VALUES ('MTR', '', '', 0, '', NULL, '2013-01-15 16:36:48', '', '', '2013-01-15 16:36:48')
---
  def create
    @search = Search.new(params[:search])

    respond_to do |format|
      if @search.save