site_stock/app/controllers/sites_controller.rb

  def index
    @sites = Site.search params[:search]
---
SELECT `sites`.* FROM `sites`

  def show
    @site = Site.find(params[:id])
---
SELECT `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1

  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save
---
INSERT INTO `sites` (`ACCESO`, `COD_SITE`, `COORDENADAS`, `DESCRIPCION`, `ID_ISLA`, `ID_MEDIO`, `NOM_SITE`, `ZONA`, `created_at`, `updated_at`) VALUES ('Fibra', 'MTR001', '123', '', 1, NULL, 'Ericsson', 'Here', '2013-01-15 16:40:12', '2013-01-15 16:40:12')