site_stock/app/views/home/index.html.erb

SELECT `medios`.* FROM `medios`
---
		Seleccionar Medio:
		<%= collection_select(:site, :medio_id, Medio.all, :id, :tipo_medio, :include_blank => "--Todos--" ) %>